/* eslint-disable indent */

export const locations = [ // name, lat, long, category
  ['Языковая школа «Знатоки»', 54.969765, 82.876022, 'organization'],
  ['Корейский центр НГУ', 54.843225, 83.093115, 'organization'],
  ['Восток-Запад', 54.986362, 82.908105, 'organization'],
  ['Языковая школа «Знатоки»', 54.9346092, 82.9098424, 'organization'],
  ['KJC School', 55.0485682, 82.9114531, 'organization'],
  ['Муниципальный культурный центр «Сибирь – Хоккайдо»', 55.025203, 82.938168, 'organization'],
  ['Общественная организация "Национально-культурная Автономия Корейцев Новосибирской области"', 55.040897, 82.940048, 'organization'],
  ['Корейский культурный центр "Сэммуль"', 55.0763672, 82.8894569, 'organization'],
  ['Силла', 55.0462867, 82.9195952, 'food'],
  ['Rika', 59.851639, 30.219324, 'food'],
  ['Син Хун Гван', 55.021455, 82.942559, 'food'],
  ['Han San', 55.0389802, 82.9275472, 'food'],
  ['Chingu', 55.033585, 82.904499, 'food'],
  ['Chingu', 55.0558773, 82.9123272, 'food'],
  ['Клуб любителей корейского языка"УриЧип"', 58.522869, 31.259769, ''],
  ['Музей стрит-арта', 59.959581, 30.43974, ''],
  ['Ассоциация корейских культурных центров Узбекистана', 41.2677311, 69.3674558, ''],
  ['Ростовское Отделение Корейского культурного центра', 47.2308034, 39.7363257, ''],
  ['Yeosu Expo Convention Center', 34.7417908, 127.7536865, 'food'],
  ['Корейский театр музыкальной комедии', 43.2516694, 76.9314012, 'organization'],
  ['Мига', 59.9238607, 30.2917951, 'food'],
  ['Кореана', 60.034572, 30.3293469, 'food'],
  ['Seoul', 59.9327037, 30.3222333, 'food'],
  ['Omo', 59.946679, 30.28511, 'food'],
  ['Mashita', 59.9343563, 30.3393502, 'food'],
  ['Mashita', 59.9256764, 30.3408872, 'food'],
  ['Korean BBQ', 59.907711, 30.2742361, 'food'],
  ['Koreana Light', 59.8195904, 30.3166864, 'food'],
  ['Babjib', 59.9414037, 30.2808023, 'food'],
  ['Babjib', 59.9324235, 30.3542375, 'food'],
  ['Европейско-Азиатская Федерация Хапкидо', 59.9221499, 30.4768363, 'organization'],
  ['Европейско-Азиатская Федерация Хапкидо', 59.9118196, 30.2979019, 'organization'],
  ['Европейско-Азиатская Федерация Хапкидо', 59.9311153, 30.425461, 'organization'],
  ['Корейский культурный центр г. Нур-Султан', 51.1641689, 71.4370376, 'food'],
  ['엄마네 Омманэ', 59.9358417, 30.3106252, 'food'],
  ['Легкоатлетический футбольный комплекс ЦСКА', 55.790873, 37.5393229, ''],
  ['Известия Hall', 55.7660598, 37.6052862, ''],
  ['Корейская национальная библиотека для детей и юношества', 37.5008695, 127.0296393, ''],
  ['Университет иностранных языков Хангук', 37.5976171, 127.0582192, 'food'],
  ['코즈모임공간 교대점', 37.4941883, 127.016567, ''],
  ['Генеральное консульство Республики Корея в Санкт-Петербурге', 59.939026, 30.358497, 'organization'],
  ['Дом Национальностей, Белый Зал', 59.943984, 30.344806, ''],
  ['Научно-техническое общество «АНТОК»', 55.6535242, 37.5378947, ''],
  ['Центр Восточных Культур KITSUNE', 59.9668911, 30.3129593, ''],
  ['Концертный зал "Чунган"', 37.5739185, 127.0850931, ''],
  ['Koreana Light', 59.9242275, 30.3557254, 'food'],
  ['Местная религиозная организация "Церковь евангельских христиан "Благодатная миссия"', 59.9441651, 30.282784, 'church'],
  ['Местная религиозная организация христиан веры евангельской "Санкт-Петербургская Пресвитерианская церковь".', 59.923703, 30.413764, 'church'],
  ['EgoRound', 59.925792, 30.3459111, 'organization'],
  ['MBC School', 59.914663, 30.4527869, 'organization'],
  ['Санкт-Петербургская школа корейского языка', 59.9479968, 30.27007, 'organization'],
  ['Guru way', 59.9309099, 30.3235137, 'organization'],
  ['САКУРА', 59.9261877, 30.3086591, 'organization'],
  ['Центр Восточных Языков', 59.9449704, 30.2886954, 'organization'],
  ['Центр восточных языков “Иероглиф”', 59.9363146, 30.316909, 'organization'],
  ['Восточный факультет Санкт-Петербургского Государственного Университета', 59.9398523, 30.2993727, 'organization'],
  ['Корейский молодёжный культурно-просветительский центр "НАН"', 59.961794, 30.2953551, 'organization'],
  ['Санты', 59.9319592, 30.3208312, 'organization'],
  ['Kitsune', 59.9668916, 30.3129624, 'organization'],
  ['Kitsune', 59.8956473, 30.2809211, 'organization'],
  ['Kitsune', 60.0023322, 30.2646894, 'organization'],
  ['TERRA School', 59.860887, 30.2451469, 'organization'],
  ['TERRA School', 59.9074843, 30.3008242, 'organization'],
  ['Восток-Европа', 59.9242275, 30.3557254, 'organization'],
  ['Школа корейского языка САН', 59.9487402, 30.3598737, 'organization'],
  ['Корейский Культурный Центр', 59.9487531, 30.3598213, 'organization'],
  ['Корея Маркет', 59.923557, 30.2904553, 'store'],
  ['Магазин корейских салатов, специй и сухофруктов', 59.830494, 30.5080941, 'store'],
  ['Красный дракон', 59.958397144195, 30.310801153442, 'store'],
  ['Красный дракон', 59.850729165823, 30.32553717473, 'store'],
  ['Красный дракон', 60.037645, 30.326527, 'store'],
  ['Красный дракон', 59.9229139, 30.3483192, 'store'],
  ['Паприка', 60.01575, 30.285733, 'store'],
  ['Момо Chicken', 59.9981231, 30.1976997, 'store'],
  ['Корейский культурный центр в Москве', 55.761997, 37.6454839, 'food'],
  ['Menga (Корейский дом)', 59.996647, 30.1312581, 'food'],
  ['Кимчи-бар Mr. Che', 59.925988, 30.3183699, 'food'],
  ['Ченджу', 59.941856, 30.223433, 'food'],
  ['Yimone cafe 이모네', 59.8894137, 30.272305, 'food'],
  ['Cham BBQ', 59.9861931, 30.2050475, 'food'],
  ['МаккоЛи', 59.934409, 30.362633, 'food'],
  ['Шилла', 59.9416952, 30.323055, 'food'],
  ['Mashita', 59.965806, 30.311187, 'food'],
  ['Koreana Light', 59.9300835, 30.3663797, 'food'],
  ['Бивон', 59.928505, 30.307947, 'food'],
  ['Кореана', 60.007555, 30.2647351, 'food'],
  ['Кореана', 59.870517, 30.3125031, 'food'],
  ['Кореана', 59.9321822, 30.3161376, 'food'],
  ['BabJib', 59.954962, 30.3278621, 'store'],
  ['Культурный центр Посольства Республики Корея в г. Москва', 55.761997, 37.6454839, ''],
  ['Государственный музей Востока', 55.7561489, 37.6002673, ''],
  ['Hansang Lab', 59.96194107407, 30.306656089066, 'organization'],
  ['Центр языкового тестирования СПбГУ', 59.935908, 30.2827691, 'organization'],
]

export const infoWindowContent = [ // name, category, address, url, tel, time
  [
      'Языковая школа «Знатоки»',
      'Курсы корейского языка', 'ул. Костычева, 74/1', 'znatoki-nsk.ru', '7 (383) 277–78–99', 'ПН-СБ 9:00-21:00'],
  [
        'Корейский центр НГУ',
        'Курсы корейского языка', 'ул. Пирогова, 2', 'kc.nsu.ru', '7–905–951–93–08', 'ПН-ЧТ  09:00–18:00'],
  [
        'Восток-Запад',
        'Научно-образовательный центр', 'ул. Геодезическая, 10', 'www.vostok-zapad.nstu.ru', '7 (383) 346–41–36', 'ПН-ПТ 10:00–18:00'],
  [
        'Языковая школа «Знатоки»',
        'Курсы корейского языка', 'ул. Громова, 17', 'znatoki-nsk.ru', '7 (383) 277–78–99', 'ПН-СБ 9:00-21:00'],
  [
        'KJC School',
        'Курсы корейского языка', 'ул. Советская, 64, офис 602', 'https://kjcschool.ru/', '277-33-88', 'Пн-Пт 12:00-20:00, Сб-Вс 12:00-18:00'],
  [
        'Муниципальный культурный центр «Сибирь – Хоккайдо»',
        '', 'ул. Шевченко, 28/1', '', '200-34-54, 200-38-96'],
  [
        'Общественная организация "Национально-культурная Автономия Корейцев Новосибирской области"',
        '', 'ул. Державина, 59', '', '7 923 141 75 55'],
  [
        'Корейский культурный центр "Сэммуль"',
        '', 'ул. 3 Сентября, 27', '', '8-913-985-13-57'],
  [
        'Силла',
        '', 'ул. Достоевского, 19', '', '8 (383) 213-85-15', 'ПН-ВС 11.00–23.00'],
  [
        'Rika',
        'Кафе', 'Ленинский просп., 99', '', 'ПН-ВС 12:00-23:00'],
  [
        'Син Хун Гван',
        '', 'ул. Льва Толстого, 5', 'http://sinhungvan.ukit.me/', '7 (383) 240 80 54', 'ПН-ВС 12.00–23.00'],
  [
        'Han San',
        '', 'ул. Державина, 28', 'www.hansan.ru', '7 (383) 211 10 14', 'ПН-ПТ 10.00–21.00, СБ 10.00–18.00'],
  [
        'Chingu',
        '', 'ул. Вокзальная Магистраль, 6А', 'https://www.facebook.com/CHINGOnsk/', '8 (983) 127-51-62', 'ПН-ВС 11.00–00.00'],
  [
        'Chingu',
        '', 'Красный пр-т., 101', 'https://www.facebook.com/CHINGOnsk/', '8 (983) 127-51-62', 'ПН-ВС 10.00–22.00'],
  [
        'Клуб любителей корейского языка"УриЧип"',
        '', 'Псковская улица, 1', '', '7 953 900 17 32'],
  [
        'Музей стрит-арта',
        '', 'шоссе Революции, 84АБ'],
  [
        'Ассоциация корейских культурных центров Узбекистана',
        '', 'Ахангаранское шоссе, дом 11 (ориентир: 40 Лет Победы. Авиосозлар 1).'],
  [
        'Ростовское Отделение Корейского культурного центра',
        '', 'ул. Пушкинская, 225/41, 1 этаж', 'rrpokce@gmail.com', '7 (863) 2-500-462'],
  [
        'Yeosu Expo Convention Center',
        '', 'Sujeong-dong'],
  [
        'Корейский театр музыкальной комедии',
        'Государственный республиканский академический корейский театр музыкальной комедии', 'Богенбай батыра 158', 'http://koreantheatre.com', '7 707 828 50 18'],
  [
        'Мига',
        'Ресторан корейской кухни', 'ул. Союза Печатников, 9', 'Miga.tilda.ws', '7(812)-714-42-31', 'Пн-ВС 11:00 -23:00 '],
  [
        'Кореана',
        'Ресторан корейской кухни', 'ул. Сикейроса, 11', 'www.koreana-spb.ru', '7(812) 296-45-63 ,7(812) 603-47-47 (доставка)', 'Пн-ВС 12:00-23:00'],
  [
        'Seoul',
        'Ресторан корейской кухни', 'Казанская ул., 8', 'www.facebook.com/seoul.spb', '7(812) 617-48-30', 'Пн-ВС 11:00-23:00'],
  [
        'Omo',
        'Корейское кафе', 'Кадетская лин. ВО, 29', 'www.facebook.com/cafeomo', '7(812) 980-98-85', 'Пн-ВС 12:00-23:00'],
  [
        'Mashita',
        'Кафе-раменная', 'Невский пр., 60', 'www.mashita-ramen.ru', '7(812) 570-41-25', 'Пн-ВС 11:00-23:00'],
  [
        'Mashita',
        'Кафе-раменная', 'Загородный просп., 15', 'www.mashita-ramen.ru', '7(812) 713-32-15', 'Пн-ВС 11:00-23:00'],
  [
        'Korean BBQ',
        'Ресторан корейской кухни', 'Старо-Петергофский пр., 27 корпус 1', 'koreanbbq.spb.ru', '7(812) 496-99-96', 'Пн-ВС 11:00-23:00'],
  [
        'Koreana Light',
        'Ресторан корейской кухни', 'Пулковское шоссе 25 корпус 1, лит. А', 'koreanalight.ru', '7(911) 906-07-76'],
  [
        'Babjib',
        'Ресторан южно-корейской кухни', '6-я лин. В.О., 23', 'www.facebook.com/babjib2013', '7(812) 240-18-97', 'Пн-ВС 11:00-23:00'],
  [
        'Babjib',
        'Ресторан южно-корейской кухни', 'ул. Маяковского, 1', 'www.facebook.com/babjib2013', '7(812) 273-88-03', 'Пн-ВС 11:00-23:00'],
  [
        'Европейско-Азиатская Федерация Хапкидо',
        '', 'Улица Коллонтай, 24', 'www.hapki.ru', '79117941119 - Александр Владимирович, ,79650236572 - Татьяна Сергеевна', 'вторник и четверг с 17:00 до 18:30'],
  [
        'Европейско-Азиатская Федерация Хапкидо',
        '', 'Лермонтовский проспект, 52', 'www.hapki.ru', '79117941119 - Александр Владимирович, ,79650236572 - Татьяна Сергеевна', 'вторник и пятница с 17.00 до 21.00'],
  [
        'Европейско-Азиатская Федерация Хапкидо',
        '', 'Заневский проспект, 53 корпус 2', 'www.hapki.ru', '79117941119 - Александр Владимирович, ,79650236572 - Татьяна Сергеевна', 'понедельник, среда с 18:00 до 21:00, суббота с 17:00 до 20:00'],
  [
        'Корейский культурный центр г. Нур-Султан',
        '', 'ул. Иманова 13', 'http://kaz.korean-culture.org', '7 (7172) 901-113- 5', 'Часы Работы Пн.– Чт.: 10:00 - 20:00 Пт.: 10:00 - 18:00 Сб.: 14:00 - 19:00 Вс, праздничные дни : Выходные'],
  [
        '엄마네 Омманэ',
        'Ресторан корейской кухни', 'Гороховая ул., 3', 'ommane.ru', '7 812 571‑69-49', 'Пн-ВС 11:00-23:00'],
  [
        'Легкоатлетический футбольный комплекс ЦСКА',
        '', 'Ленинградский проспект дом 39 строение 1'],
  [
        'Известия Hall',
        '', 'Пушкинская пл., 5'],
  [
        'Корейская национальная библиотека для детей и юношества',
        '', '21 Teheran-ro 7-gil, Yeoksam-dong, Gangnam-gu'],
  [
        'Университет иностранных языков Хангук',
        'Частный университет в Южной Корее', '107 Imun-ro, Imun-dong, Dongdaemun-gu'],
  [
        '코즈모임공간 교대점',
        '', '서울 서초구 서초동 1674-4'],
  [
        'Генеральное консульство Республики Корея в Санкт-Петербурге',
        '', 'ул. Некрасова, 32-А', 'http://overseas.mofa.go.kr/ru-stpetersburg-ru/index.do', '7 (812) 448-1500'],
  [
        'Дом Национальностей, Белый Зал',
        '', 'Моховая ул., д. 15'],
  [
        'Научно-техническое общество «АНТОК»',
        '', 'Профсоюзная ул., дом 65, стр. 1, 4 этаж', '', '7 (495) 787-42-31'],
  [
        'Центр Восточных Культур KITSUNE',
        '', 'Большой пр. ПС, 100 оф.700', 'kitsune.spb.ru'],
  [
        'Концертный зал "Чунган"',
        '', 'Myeonmok-dong 378-5'],
  [
        'Koreana Light',
        'ресторан корейской кухни', 'Лиговский пр., 87а', 'www.koreanalight.ru', '8 (911)‒906‒07‒76', 'Ежедневно 10:00 – 23:00'],
  [
        'Местная религиозная организация "Церковь евангельских христиан "Благодатная миссия"',
        'Воскресенье - 14:30', 'Средний проспект В.О., 18', 'https://vk.com/club44971980'],
  [
        'Местная религиозная организация христиан веры евангельской "Санкт-Петербургская Пресвитерианская церковь".',
        'ВОСКРЕСНЫЕ БОГОСЛУЖЕНИЯ: На русском языке- 10:30, на корейском языке- 13:00 . Детское служение - 11:00 (первое воскресенье месяца детское служение объединено с основным служением). Подростковое служение - 13:00', 'Таллинская ул., д.9', 'https://vk.com/jesusoursavior'],
  [
        'EgoRound',
        'Курсы корейского языка', 'Большая Московская ул., 11', 'http://www.egoround.ru/', '7 (812) 575-78-05'],
  [
        'MBC School',
        'Курсы корейского языка', 'ул. Коллонтай, 7', 'http://mbcschool.ru/kursyi-vostochnyix-yazyikov-v-sankt-peterburge/kursyi-korejskogo-yazyika-v-sankt-peterburge.html', '7 (812) 642-19-10'],
  [
        'Санкт-Петербургская школа корейского языка',
        '', '8-я линия В.О., 83а', 'https://vk.com/koreanschool'],
  [
        'Guru way',
        'Курсы корейского языка', 'Банковский пер., 3', 'http://guru-way.ru/yazyki/korejskij', '8 (812) 244-80-98'],
  [
        'САКУРА',
        'Курсы корейского языка', 'наб. канала Грибоедова, 76', 'https://www.inyaz-sakura.ru/kursy_korejskogo_yazyka.htm', '8 (812) 961-81-27'],
  [
        'Центр Восточных Языков',
        'Курсы корейского языка', 'Тучков пер., 11/5', 'http://www.orientalcenter.spb.ru/korejskij-yazyik.html', '8 (812) 320-99-21'],
  [
        'Центр восточных языков “Иероглиф”',
        'Курсы корейского языка', 'Невский пр., 13/9', 'http://eroglif.com/', '7(812) 939-64-04'],
  [
        'Восточный факультет Санкт-Петербургского Государственного Университета',
        'Курсы корейского языка', 'Университетская наб., 11', 'http://orient.spbu.ru/ru/', '8 (812) 328-77-32'],
  [
        'Корейский молодёжный культурно-просветительский центр "НАН"',
        'Курсы корейского языка.', 'Ораниенбаумская ул., 27', 'https://vk.com/centernan'],
  [
        'Санты',
        'Школа корейского языка', 'Казанская ул., 7', 'http://korea-school.ru/', '7 (953) 345-47-70'],
  [
        'Kitsune',
        'Центр Восточных Культур. Курсы корейского языка.', 'Большой проспект П.С., 100', '', '8 (812) 986-43-07', 'Ежедневно 9:00 – 21:00'],
  [
        'Kitsune',
        'Центр Восточных Культур. Курсы корейского языка.', 'ул. Швецова, 17', 'https://kitsune.spb.ru', '8 (812) 986-43-07', 'Ежедневно 12:00 – 21:00'],
  [
        'Kitsune',
        'Центр Восточных Культур. Курсы корейского языка.', 'Комендантский пр., 4а', 'https://kitsune.spb.ru', '8 (812) 986-43-07', 'Ежедневно 12:00 – 21:00'],
  [
        'TERRA School',
        'Курсы корейского языка', 'ул. Маршала Казакова, 3, корп. 2', 'http://terra-school.ru/', '8 (812) 715-29-09', 'Ежедневно 11:00 – 20:00'],
  [
        'TERRA School',
        'Курсы корейского языка', 'Митрофаньевское ш., 2/1', 'http://terra-school.ru/', '7 (812) 441-37-73', 'Ежедневно 11:00 – 20:00'],
  [
        'Восток-Европа',
        'Языковой и культурный центр', 'Лиговский пр., 87', 'http://vostoc-europa.ru', '7 (921) 338-63-18', 'Ежедневно 11:00 – 20:00'],
  [
        'Школа корейского языка САН',
        '', 'пр. Чернышевского, 4', 'https://studykorean.ru/', '79992315761', 'Ежедневно 12:00 – 22:00'],
  [
        'Корейский Культурный Центр',
        'Курсы корейского языка', 'Шпалерная ул., 37', 'https://vk.com/korean_class'],
  [
        'Корея Маркет',
        'Товары из Кореи', 'ул. Союза Печатников, 15', 'http://koreamarket78.com', '8 (812) 240-33-54', 'Ежедневно 11:00 – 20:00'],
  [
        'Магазин корейских салатов, специй и сухофруктов',
        '', 'Караваевская ул., 25 к. 3 лит. А', 'Ежедневно 9:00 – 21:00'],
  [
        'Красный дракон',
        'Магазин азиатских продуктов ', 'ул. Воскова, 27', 'http://reddragon-spb.ru/', '8 (812) 701 01 87', 'Ежедневно 10:00 – 21:00'],
  [
        'Красный дракон',
        'Магазин азиатских продуктов ', 'ул. Типанова, 4', 'http://reddragon-spb.ru/', '8 (812) 701 01 87', 'Ежедневно 11:00 – 20:00'],
  [
        'Красный дракон',
        'Магазин азиатских продуктов', 'пр. Энгельса, 113 к. 2', 'http://reddragon-spb.ru/', '8 (812) 701 01 87', 'Ежедневно 11:00 – 20:00'],
  [
        'Красный дракон',
        'Магазин азиатских продуктов ', 'Боровая ул., 3', 'http://reddragon-spb.ru/', '7 (812) 701-01-87'],
  [
        'Паприка',
        'Сеть магазинов корейских деликатесов', 'Парашютная ул., 10', '', '', 'Ежедневно 10:00 – 22:00'],
  [
        'Момо Chicken',
        'Центр корейских товаров и доставка корейской еды', 'Лыжный переулок, 4 к.3', 'http://momochicken.ru/', '7 (812) 992-36-37', 'Ежедневно 12:00 – 22:00'],
  [
        'Корейский культурный центр в Москве',
        '', 'Чистопрудный бул., 17, с. 1'],
  [
        'Menga (Корейский дом)',
        '', 'Коннолахтинский пр., 4', '7 (965) 055-61-18'],
  [
        'Кимчи-бар Mr. Che',
        '', 'пр. Московский, д. 2/6', 'https://m.vk.com/kimchi_bar', '7 (931) 328-00-78'],
  [
        'Ченджу',
        'Ресторан корейской кухни', 'ул. Нахимова, 9', 'http://www.jeonju.ru', '7 (921) 728-38-89', 'Пн-ВС 11:00 -23:00'],
  [
        'Yimone cafe 이모네',
        'Ресторан корейской кухни', 'ул. Трефолева, 18а', '', '7 (921) 728-38-89'],
  [
        'Cham BBQ',
        '', 'Беговая ул., 3', '7 (812) 345-05-50'],
  [
        'МаккоЛи',
        'Ресторан корейской кухни', 'Лиговский пр., 25', 'http://makkoli-spb.ru', '7 (812) 443-87-78', 'Пн–Чт и Вс: 11:00 — 23:00, Пт–Сб: 11:00 — 01:00 '],
  [
        'Шилла',
        'Ресторан корейской кухни', 'наб. реки Мойки, 6/1', '', '7 (812) 571-69-71'],
  [
        'Mashita',
        'Рамённая', 'Каменноостровский пр., 38/96', 'http://mashita-ramen.ru', '7 (812) 346-24-85'],
  [
        'Koreana Light',
        'ресторан корейской кухни, корейская уличная еда', 'Невский пр., 95', 'https://www.koreanalight.ru', '7 (911) 906-07-76'],
  [
        'Бивон',
        'Ресторан корейской кухни', 'Вознесенский пр., 15', '', '7 (926) 184-08-29'],
  [
        'Кореана',
        'Ресторан корейской культуры', 'пр. Испытателей, 37', 'http://www.koreana-spb.ru/', '7 (812) 926-27-60'],
  [
        'Кореана',
        'Ресторан корейской культуры', 'Варшавская ул., 23 корпус 1', 'http://www.koreana-spb.ru/', '7 (812) 915-42-26'],
  [
        'Кореана',
        'Ресторан корейской культуры', 'Гороховая ул., 17, Санкт-Петербург, 190000', 'http://www.koreana-spb.ru/', '7 (812) 714-42-31'],
  [
        'BabJib',
        'Магазин корейских товаров и кафе', 'ул. Куйбышева, 7', 'https://vk.com/babjib', '7 (911) 102-64-92'],
  [
        'Культурный центр Посольства Республики Корея в г. Москва',
        '', 'Чистопрудный бульвар, д. 17, с.1'],
  [
        'Государственный музей Востока',
        '', 'Никитский бул. 12А'],
  [
        'Hansang Lab',
        '', 'Литейный проспект, 42', 'https://hansanglab.com'],
  [
        'Центр языкового тестирования СПбГУ',
        '', 'наб. Лейтенанта Шмидта, д. 11', 'http://testingcenter.spbu.ru/topik.html', '325-11-24'],
]

// name, lat, long, category ++ name, category, address, url, tel, time
export const loc = locations.map((item, i) => [...item, ...infoWindowContent[i]])

export const categories = () => {
  const cats = []
  loc.forEach((item) => {
    if (!cats.find((i) => i === item[3]) && item[3] !== '') {
      cats.push(item[3])
    }
  })
  return cats
}

export const rusCats = {
  organization: { title: 'Организации', color: '#72BE44' },
  food: { title: 'Рестораны', color: '#B62655' },
  church: { title: 'Церкви', color: '#00AADB' },
  store: { title: 'Магазины', color: '#FBAE17' },
}
