export const authErrors = {
  100: 'Пожалуйста, проверьте правильность заполнения полей',
  150: 'Пожалуйста, проверьте правильность заполнения полей',
  200: 'Такого пользователя не существует',
  250: 'Кажется, у вас нет пароля...',
  300: 'Проверьте правильность заполнения пароля',
  500: 'Произошла ошибка. Пожалуйста, попробуйте позже',
}
// - Email empty 100;
// - Password empty 150
// - User not found 200
// - User has no password 250
// - Incorrect password 300
// - Session not created 500

export const logoutErrors = {
  100: 'Что-то пошло не так',
}
// 'Session empty', 100
